blog/2022-0907-2.org
#+TITLE: org-modeでgithub pagesのサイトを作る
#+Author: biofermin2
#+REVEAL_TITLE_SLIDE_BACKGROUND: img/biofermin2-symbol.png
#+REVEAL_TITLE_SLIDE_BACKGROUND_SIZE: 80px
# #+REVEAL_TITLE_SLIDE_BACKGROUND_REPEAT: repeat
#+REVEAL_TITLE_SLIDE: <h3>%t</h3><h4>%a</h4>
#+REVEAL_EXTRA_CSS: ./local.css

# https://revealjs.com/themes/
# #+REVEAL_THEME: blood
#+REVEAL_ROOT: ../reveal.js/
# #+REVEAL: split
#+REVEAL_TITLE_SLIDE_BACKGROUND_POSITION: top right
#+reveal_slide_toc_footer: t
#+REVEAL_DEFAULT_SLIDE_BACKGROUND: img/biofermin2-symbol.png
#+REVEAL_DEFAULT_SLIDE_BACKGROUND_SIZE: 80px
#+REVEAL_DEFAULT_SLIDE_BACKGROUND_POSITION: top right
#+REVEAL_EXPORT_NOTES_TO_PDF:t

# 目次やら番号を消したい時
#+OPTIONS: num:nil toc:nil

* org-modeによるpagesの作成
org-modeでorgファイルを作成し、
それをhtml化して、github pagesに
アップロード出来るか実験してみる。

* orgファイルのhtml化の方法
  現段階で思いつくhtml化の方法は２通りある。
昔org-publishとかやっていたけど、今ではその設定は消したので、
なるべくシンプルなもので行こうと思う。

** org-re-reveal
C-cC-evb
htmlとして出力されるが、
revealjsとリンクしてプレゼン画面のような動きのある見た目になる。
これに関してはローカルで出力しているため、
ローカルディレクトリにリンクされている。
pagesにアップロードするのであるなら、
revealjsもアップロードし、
リンク先を変更してあげる必要はある。
そういう意味では若干面倒臭い面もある。

** orgモードでexport
C-cC-eho
普通のhtmlになる。

* 問題点
** いずれもauthorに自分の名前がダイレクトに出てきたので、
アカウント名に変更したい。そのためには
org-modeで#+authorだかのタグをつけないといけないが、
毎回そんなものを手で入力するのも邪魔くさい。
autoinsertには自分の個人用のルーティンページ設定に
なっているし、曜日毎にルーティングの内容設定を自動切り替えしている
ため変更したくない。
よって、随分使ってないyasnippetを活用していこうと思う。
** yasnippet
特に使いたいスニペットってなかったので、
使い方をほぼほぼ忘れてしまった。
ただ毎回定型の決まりきった作業をする時にはあれは便利かもしれない。
init.elでのyasnippet関連の設定を見ると 
("C-c y" . ivy-yasnippet)
("C-c C-y" . ivy-yasnippet)
("C-x i n" . yas-new-snippet) ; 新規スニペットを作成するバッファを用意する
("C-x i i"   . yas-insert-snippet) ; 既存スニペットを挿入する
("C-x i v" . yas-visit-snippet-file)); 既存スニペットを閲覧・編集する

こんな形で設定はされている。
正直いって、ivy-yasnippetって要るのか？と思っているが
とりあえず、入れてある。
では早速snippetを作ってみよう。
** 新規作成だから
C-x i nだ。そうすると
新規バッファが開き
とりあえず、presentation用なので、
名前をpresentation-top-setting
keyはpre
にしてみる。
$0,$1,$2とtabで移動したいポイントを指定する。

[[../index.html][top]] [[./lisp-menu.html][次へ]]
